The  BuiltInFailures ImageFailures  type exposes the following members.
 Properties
Name  |   Description
BadViewType
 Image Instances can't be placed in 3D Views.
 See Also
  BuiltInFailures ImageFailures Class
  Autodesk.Revit.DB Namespace